# Handling missing values

In [31]:
import pandas as pd
import numpy as np

In [32]:
df=pd.DataFrame({'a':[1,2,np.nan],'b':[1,np.nan,np.nan],'c':[1,2,3]})

df

     a    b  c
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

     a    b  c
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [33]:
#checlking the missing Values

df.isna().any()

a     True
b     True
c    False
dtype: bool

a     True
b     True
c    False
dtype: bool

In [34]:
df.isna().sum()

a    1
b    2
c    0
dtype: int64

a    1
b    2
c    0
dtype: int64

In [35]:
#handling missing value using dropna()

df.dropna()

     a    b  c
0  1.0  1.0  1

     a    b  c
0  1.0  1.0  1

In [36]:
df

     a    b  c
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

     a    b  c
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [37]:
#mean
df.mean()

a    1.5
b    1.0
c    2.0
dtype: float64

a    1.5
b    1.0
c    2.0
dtype: float64

In [38]:
df['a'].mean()

1.5

1.5

In [39]:
#lets replace the null value with mean vlaue

df['a'].fillna(df['a'].mean(),inplace=True)

df

     a    b  c
0  1.0  1.0  1
1  2.0  NaN  2
2  1.5  NaN  3

     a    b  c
0  1.0  1.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [40]:
#lets replace the null values with median value
df['b'].fillna(df['b'].median(),inplace=True)

df

     a    b  c
0  1.0  1.0  1
1  2.0  1.0  2
2  1.5  1.0  3

     a    b  c
0  1.0  1.0  1
1  2.0  1.0  2
2  1.5  1.0  3

In [41]:
#mode

In [42]:
#
data={'name':['rahul','tirumal','sanjay'],
     'age':[20,21,22],
     'degree':['BE','BE','BCA'],
     'percentage':[60,70,80]}

data

{'name': ['rahul', 'tirumal', 'sanjay'],
 'age': [20, 21, 22],
 'degree': ['BE', 'BE', 'BCA'],
 'percentage': [60, 70, 80]}

{'name': ['rahul', 'tirumal', 'sanjay'],
 'age': [20, 21, 22],
 'degree': ['BE', 'BE', 'BCA'],
 'percentage': [60, 70, 80]}

In [43]:
df1=pd.DataFrame(data=data,index=['row1','row2','row3'])

df1

         name  age degree  percentage
row1    rahul   20     BE          60
row2  tirumal   21     BE          70
row3   sanjay   22    BCA          80

         name  age degree  percentage
row1    rahul   20     BE          60
row2  tirumal   21     BE          70
row3   sanjay   22    BCA          80

In [44]:
#lets use replace funtion , to replace some values
df1=df1.replace('BCA',np.nan)
df1

         name  age degree  percentage
row1    rahul   20     BE          60
row2  tirumal   21     BE          70
row3   sanjay   22    NaN          80

         name  age degree  percentage
row1    rahul   20     BE          60
row2  tirumal   21     BE          70
row3   sanjay   22    NaN          80

In [45]:
#lets replace with mode value
df1['degree']=df1['degree'].fillna(df1['degree'].mode()[0])
df1

         name  age degree  percentage
row1    rahul   20     BE          60
row2  tirumal   21     BE          70
row3   sanjay   22     BE          80

         name  age degree  percentage
row1    rahul   20     BE          60
row2  tirumal   21     BE          70
row3   sanjay   22     BE          80